[
    {
        "pageId": "homePage",
        "title": "Home | Dangerous to go Alone Wiki | Mod for BOTW",
        "pageContent": "<div id=\"tsparticles\"></div><div class=\"logo-centerer\"><div class=\"logo-container\"><img src=\"Assets/DtgA-logo_Final-Gapless.webp\" alt=\"\"><p>A <i>massive </i>overhaul mod for BotW</p></div></div>"
    },
    {
        "pageId": "aboutPage",
        "title": "About Us | Dangerous to go Alone Wiki | Mod for BOTW",
        "pageContent": "<div class=\"about-container\"><h1 class=\"about-title\">What is ''Dangerous To Go Alone'' ?</h1><div class=\"about-box\"><h3 class=\"about-subtitle\">DtgA is an absolutely massive overhaul mod for Breath of the Wild that changes almost every core aspect of the game.</h3><ul><li>Explore a revamped Hyrule with new challenges, items, friends, and an overhauled progression system.</li><li>Encounter classic foes and new bosses, facing tougher enemies with increased rewards.</li><li>Discover unique, upgradable weapons and RPG-style movement abilities.</li><li>Experience a new spellcasting system, unlocking your ability to cast elemental magic.</li><li>Navigate the night with various lanterns, and find other unique items to enhance your adventures.</li><li>Encounter new NPCs, explore fresh areas, and complete new quests.</li><li>Reunite with familiar faces from Hyrule's past to aid in your journey with the 'Champions Ride Again' feature.</li><li>Visit the <button class=\"pageNav\" id=\"newMechanicsPage\">New Mechanics</button> page to learn about each new mechanic in greater detail.</li></ul></div><h2 class=\"about-title\">Who is the Creator of DtgA?</h2><div class=\"about-box\"><h3 class=\"about-subtitle\">Zoey Eule</h3><ul><li>COMING SOON</li></ul></div><h2 class=\"about-title\">Why was this site created?</h2><div class=\"about-box\"><h3 class=\"about-subtitle\">Your source of any information and help you may need!</h3><ul><li>Seeing the common queries in the Wildmods Discord Channel, I aimed to address installation issues and offer detailed explanations to help the community.</li><li>I wanted to build a comprehensive, organized wiki, a one-stop solution for users seeking specific details on features, items, and mechanics.</li><li>My goal was to provide step-by-step guidance, from the game's installation to explaining the intricate aspects of everything offered by DtgA.</li><li>I envisioned a user-friendly resource center, consolidating information to save users from the hassle of hunting through scattered sources.</li></ul></div><h2 class=\"about-title\">Who created this Website?</h2><div class=\"about-box\"><h3 class=\"about-subtitle\">Jack Smith (Clonephaze)</h3><ul><li>I'm a software developer and frontend developer proficient in JavaScript and Jquery, Python, HTML, and CSS.</li><li>The original design of this website was my very first attempt at creating a website! The site has since been revamped quite a bit, and I hope to continue to improve it in the future.</li><li>I'm always eager to assist and contribute, whether it's offering help or advice, or even just creating a good vibe.</li><li>Feel free to reach out to me if you have any questions!</li></ul></div></div>"
    },
    {
        "pageId": "gettingStartedPage",
        "title": "Getting Started | Dangerous to go Alone Wiki | Mod for BOTW",
        "pageContent": "<div class=\"get-sta-container\"><div class=\"gs-download-container\"><h1 class=\"get-sta-title\">Downloads</h1><div class=\"highlight-bar\">You will need ReForged, ReBorn, and RenAnimated. You can optionally use DtgA DLC as well.</div><div class=\"download-cards-container\"><div class=\"download-card\"><h2>DtgA ReForged</h2><div class=\"buttons-row\"><button class=\"get-sta-button\"><i class=\"bx bx-link-external\"></i>0.76 (Public)</button> <button class=\"get-sta-button\"><i class=\"bx bx-link-external\"></i>0.77 (Supporter)</button></div></div><div class=\"download-card\"><h2>DtgA ReBorn</h2><div class=\"buttons-row\"><button class=\"get-sta-button\"><i class=\"bx bx-link-external\"></i>0.36 (Public)</button> <button class=\"get-sta-button\"><i class=\"bx bx-link-external\"></i>0.48 (Public)</button></div></div><div class=\"download-card\"><h2>DtgA ReAnimated</h2><div class=\"buttons-row\"><button class=\"get-sta-button\"><i class=\"bx bx-link-external\"></i>0.85 (Public)</button> <button class=\"get-sta-button\"><i class=\"bx bx-link-external\"></i>0.85 (Supporter)</button></div></div><div class=\"download-card\"><h2>DtgA DLC (Optional - Supporter Only)</h2><div class=\"buttons-row\"><button class=\"get-sta-button\"><i class=\"bx bx-link-external\"></i>RePopulated 0.37</button></div></div></div></div><div class=\"install-container\"><h2 class=\"get-sta-title\">Installation</h2><div class=\"install-cards-container\"><div class=\"install-card\"><div class=\"install-card-content\"><h3 class=\"install-card-title\">Establishing Cemu Install (Wii U Emulator)</h3><ul class=\"get-sta-list\"><li>Ensure you have a valid and working copy of Breath of the Wild for the Wii U</li><li>Download and install Cemu, link to the right</li><li>Open the Cemu application, click on \"File\" then \"Install game title, update or DLC\". Open the folder that contains your copy of Breath of the Wild, open the Meta folder, and select meta.xml</li><li>Launch your game before installing any mods to ensure your copy of Breath of the Wild is working.</li></ul></div><div class=\"install-buttons\"><button class=\"get-sta-button\"><i class=\"bx bx-link-external\"></i>Cemu Page</button></div></div><div class=\"install-card\"><div class=\"install-card-content\"><h3 class=\"install-card-title\">Installing and setting up BCML (BotW Cross-Platform Mod Loader)</h3><ul class=\"get-sta-list\"><li>Install the latest x64 Visual C++, direct download link to the right.</li><li>Install Python 3.8.10, link to the right.</li><li>Open Command Prompt: press Win+R then enter \"cmd\"</li><li>Type<p class=\"code-box\">pip install BCML</p>and press enter.</li><li>When finished, you can launch BCML by entering<p class=\"code-box\">bcml</p>.</li><li>On first launch you will be prompted to point to your copy of Breath of the Wild, which you will be guided through.</li></ul></div><div class=\"install-buttons\"><button class=\"get-sta-button\"><i class=\"bx bxs-download\"></i>Visual C++ Installer</button> <button class=\"get-sta-button\"><i class=\"bx bxs-download\"></i>Python Installer</button></div></div><div class=\"install-card\"><div class=\"install-card-content\"><h3 class=\"install-card-title\">Downloading and Installing Reqauired Mods</h3><ul class=\"get-sta-list\"><li>Install the Collision Actors mod, required for DtgA, link is to the right.</li><li>Download the DtgA modules Reborn, Reforged, and Reanimated. The download links can be found at the top of the page.</li><li>Optionally, you can download the RePopulated (DtgA's first DLC module!) mod file well if you would like that content too.</li><li>Open BCML and click the plus button in the bottom right hand corner. Do not press install until you've selected each module you wish to install, queing each time until then.</li><li>In bcml the highest mod in the list has the highest priority. Ensure Collision actors is higher than DtgA's Modules.</li><li>Launch your game with your mods using the triforce symbol in BCML.</li></ul></div><div class=\"install-buttons\"><button class=\"get-sta-button\"><i class=\"bx bx-link-external\"></i>Collison Actors Page</button></div></div></div></div><div class=\"what-to-know-container\"><h2 class=\"get-sta-title\">What you need to know</h2><div class=\"what-to-know-card\"><h3 class=\"what-to-know-title\">Wait! It's Dangerous to Go Alone, take this.</h3><h4 class=\"what-to-know-subtitle\">DtgA is an absolutely massive mod that changes a lot of the game, we'll go over what you should know first here, visit the New Mechanics page to learn more.</h4><ul class=\"what-to-know\"><li>You cannot regenerate Stamina normally anymore. Your yellow wheel now recharges your green wheel.<ul><li>It runs out slowly, and can be charged by drinking from a divine vessel.</li></ul></li><li>You cannot equip armor or use items until you rest at a campfire, and only for 30 seconds after.</li><li>You can only switch weapons, shields, or bows with the quick menus using your d-pad.</li><li>Your Spirit Orbs are now your Mana! They will count up to 100 when you first wake up, this is <b>intended</b>.</li><li>Your map will not work until you clear up the weather by calming Divine Beast Vah Ruta.</li><li>You can't climb anymore! Not until you get the climbing claws from Kakariko Village anyways.</li><li>The cold areas of Hopes Rise are hard to access, but yes there is a solution.</li><li>The paraglider is now a mid-game item. Deployable paragliders can be found in chests all over Hyrule. Plan your routes.</li></ul></div></div></div>"
    },
    {
        "pageId": "newMechanicsPage",
        "title": "New Mechanics | Dangerous to go Alone Wiki | Mod for BOTW",
        "pageContent": "<div class=\"new-mechanics-page-container\"><h1 class=\"new-mech-title\">What Dangerous to go Alone has to offer</h1><div class=\"new-mech-card-container\"><div class=\"new-mech-card\"><h2 class=\"new-mech-card-title\">Hopes Rise: A New Journey Begins</h2><div class=\"new-mech-card-description\"><ul><li>You, the hero, have transitioned from the lands of Hyrule and find yourself in Hopes Rise.</li><li>Discover the Divine Vessel, gifted by the old man, to harness portions of Hylia's light, represented by your yellow stamina wheel.</li><li>This vessel, replacing the paraglider as a reward from the old man, empowers you to traverse the expanse of Hyrule once more.</li><li>Regain your former strength by leveling up attributes such as Vitality, Endurance, Mana, Strength, Dexterity, Agility, Wisdom, Courage, Grudge, and Faith.</li></ul></div></div><div class=\"new-mech-card\"><h2 class=\"new-mech-card-title\">Revamped Game Progression</h2><div class=\"new-mech-card-description\"><ul><li>Embark on a revitalized journey where DtgA challenges you to earn your abilities.</li><li>Climbing is only possible upon discovering the Kakriko climbing claws, transforming your traversal.</li><li>Unlock the map only after calming the Devine Beast Vah Ruta, marking a milestone in your conquest.</li><li>Sheikah slate runes are now scattered across the corners of Hyrule, awaiting your retrieval.</li><li>Hunt for the paraglider hidden within the expanse of Hyrule, earning your right to soar through the skies.</li></ul></div></div><div class=\"new-mech-card\"><h2 class=\"new-mech-card-title\">New and Classic Enemies</h2><div class=\"new-mech-card-description\"><ul><li>Classic adversaries like ReDeads, Skulltulas, and Gibdos are now available in DtgA, making their return to Hyrule.</li><li>Encounter new, custom-designed bosses who bestow unique souls upon defeat.</li><li>Prepare for tougher enemies, as all have had their health pools increased in DtgA.</li><li>Prepare for tougher enemies, as all have had their health pools increased in DtgA.</li></ul></div></div><div class=\"new-mech-card\"><h2 class=\"new-mech-card-title\">Weapon Expansion</h2><div class=\"new-mech-card-description\"><ul><li>With all enemies having increased health pools, you will need some tougher weapons than those you just find lying about.</li><li>Discover DtgA's collection of five unbreakable, and up-gradeable weapons. Spanning from mighty axes to versatile bows, this arsenal caters to any playstyle.</li><li>Enhance these weapons through a unique upgrade system via the Blacksmith. Utilize regular souls to enhance your weapons, albeit temporarily, while boss souls bestow permanent enhancements to your chosen weapon.</li></ul></div></div><div class=\"new-mech-card\"><h2 class=\"new-mech-card-title\">Enhanced RPG Mechanics</h2><div class=\"new-mech-card-description\"><ul><li>Equip your gear strategically, only possible while resting at a campfire, requiring foresight in outfit planning for each leg of your journey.</li><li>Introducing new RPG-style movement abilities: Double Jump, Double Dodge, Dodge Roll, and Air Dash.</li><li>Master these agile maneuvers using DtgA's innovative control system.</li><li>Experience an immersive over-shoulder camera perspective for heightened gameplay engagement.</li></ul></div></div><div class=\"new-mech-card\"><h2 class=\"new-mech-card-title\">New Items and Classic Gadgets</h2><div class=\"new-mech-card-description\"><ul><li>DtgA brings back nostalgic gadgets from past Zelda adventures, some slightly reimagined for BotW.</li><li>Discover an array of new additions, from elemental bombs harnessing the forces of nature to ingenious metal unpoppable balloons.</li><li>Explore a diverse inventory of custom items, each designed to enhance your journey with unique abilities and functions.</li></ul></div></div><div class=\"new-mech-card\"><h2 class=\"new-mech-card-title\">New Resurrection System</h2><div class=\"new-mech-card-description\"><ul><li>Experience a paradigm shift in death: in DtgA, defeat doesn't mark Game Over.</li><li>Upon succumbing to adversaries, you'll find yourself revived at the Shrine of Resurrection.</li><li>Embrace the cyclical nature of resurrection triggered by the blood moon, akin to your adversaries.</li><li>Reclaim your lost rupees left behind upon defeat, encouraging you to re-collect and persist in your quest.</li></ul></div></div><div class=\"new-mech-card\"><h2 class=\"new-mech-card-title\">Apocolypse Spell Package</h2><div class=\"new-mech-card-description\"><ul><li>Discover an ancient Spellbook brimming with the secrets of Wizrobes and Bokoblins' arcane knowledge.</li><li>Delve into the mastery of Aero, Cryo, Electro, and Pyro elements to weave potent elemental spells.</li><li>Harness these formidable powers to cast a spectrum of elemental spells, empowering you to vanquish adversaries.</li></ul></div></div><div class=\"new-mech-card\"><h2 class=\"new-mech-card-title\">Night, Overhauled</h2><div class=\"new-mech-card-description\"><ul><li>Experience the shroud of darkness after 9:30pm (21:30), requiring a reliable light source for navigation.</li><li>Discover four distinct lantern varieties: a standard lantern and a fire-spitting variant, fueled by oil.</li><li>Uncover the Gerudo light-emitting rock lantern and the Ancient Tech lantern, offering infinite illumination.</li></ul></div></div><div class=\"new-mech-card\"><h2 class=\"new-mech-card-title\">Elemental Master Sword Enchantments</h2><div class=\"new-mech-card-description\"><ul><li>Empower The Master Sword by infusing elemental Jellies, found throughout Hyrule.</li><li>While wielding the sword, drop one of these jellies to briefly transform your blade, imbuing it with elemental prowess.</li><li>Experience the fleeting yet potent magic as your Master Sword takes on the essence of the dropped elemental jelly.</li></ul></div></div><div class=\"new-mech-card\"><h2 class=\"new-mech-card-title\">Expanded Hyrule: New NPCs & Explorable Areas</h2><div class=\"new-mech-card-description\"><ul><li>DtgA introduces an array of new structures across Hyrule, revitalizing once-empty regions and incentivizing exploration.</li><li>Embark on a journey encountering fresh NPCs offering unique wares, enriching your adventure with exclusive items.</li><li>Discover numerous DtgA items available in familiar stores, enriching the assortment of goods across Hyrule.</li></ul></div></div><div class=\"new-mech-card\"><h2 class=\"new-mech-card-title\">Item Rebalance: Elemental Arrows and Utility Items</h2><div class=\"new-mech-card-description\"><ul><li>You will discover that chests are no longer brimming with elemental arrows but instead containing diverse utility items like Metal Balloons, and Goron Powder Kegs.</li><li>Adapt your strategy by purchasing elemental arrows from stores, ensuring a stockpile of these crucial projectiles for your adventures.</li></ul></div></div><div class=\"new-mech-card new-mech-card-last\"><h2 class=\"new-mech-card-title\">Champions Ride Again</h2><div class=\"new-mech-card-description\"><ul><li>Unearth the Twilight Mirror to reunite with 15 diverse companions from across Hyrule.</li><li>From stalwart allies like Paya and Sidon to enigmatic figures such as Beedle and Maz Koshia, call upon these friends to fight alongside you.</li></ul></div></div></div></div>"
    },
    {
        "pageId": "faqPage",
        "title": "FAQ | Dangerous to go Alone Wiki | Mod for BOTW",
        "pageContent": "<div class=\"faq-page-container\"><div class=\"highlight-bar\">A collection of known issues and Frequently Asked Questions, and their solutions.</div><div class=\"faq-accordion\"><button class=\"accordion-button\"><h2 class=\"accordion-title\">Infinite Loading Screen</h2></button><div class=\"accordion-content\"><div class=\"content-centerer\"><p>If you're experiencing an infinite loading screen, you have a bug with BCML. It's an easy enough fix, but it may take a couple of tries to clear it up.</p><ol><li>Delete your BCML Merged Folder, Win+R and type<p class=\"code-box\">%localappdata%\\bcml</p>to find the folder.</li><li>Open a command prompt window</li><li>Enter<p class=\"code-box\">pip uninstall bcml --yes</p></li><li>Enter<p class=\"code-box\">pip install bcml==3.10.4</p></li><li>Open bcml and remerge your mods</li><li>Launch and play your game, if the issue persists start again at step 1 until it clears up</li></ol></div></div><button class=\"accordion-button\"><h2 class=\"accordion-title\">Missing Walls/Floors/textures</h2></button><div class=\"accordion-content\"><div class=\"content-centerer\"><p>If you walk into a shrine and find you have no textures on any of the floors or anywhere else, you're missing the collision actors mod or have a mod priority issue.</p><ol><li>Download the mod from <button class=\"link-text\">Here</button></li><li>Install it using BCML</li><li>Ensure you place it above all Dangerous to go Alone mods to avoid priority issues</li><li>Launch and play your game</li></ol></div></div><button class=\"accordion-button\"><h2 class=\"accordion-title\">Character Stuck in an animation/frozen still</h2></button><div class=\"accordion-content\"><div class=\"content-centerer\"><p>If your character gets stuck or frozen in an animation, you can click both sticks at once and your character will be freed from whatever animation got it stuck.</p></div></div><button class=\"accordion-button\"><h2 class=\"accordion-title\">The Iron/Gold Boots are stuck and I can't get them off!</h2></button><div class=\"accordion-content\"><div class=\"content-centerer\"><p>If you've just gotten the Iron boots and find that you can't get them off:</p><ol><li>Get the Hover Boots from the Sanadin Park Ruins</li><li>Summon the Magic Pouch</li><li>Take out a new Gadget</li></ol><p>This is a known issue and is being looked into.</p></div></div><button class=\"accordion-button\"><h2 class=\"accordion-title\">The game freezes mid-way through the boss fight!</h2></button><div class=\"accordion-content\"><div class=\"content-centerer\"><p>This is a known issue, and is being looked into. In the meantime you can do the following:</p><ol><li>Open your bcml merged folder at<p class=\"code-box\">%localappdata%\\bcml</p></li><li>Find<p class=\"code-box\">merged%\\aoc%\\0010%\\Pack%\\Remains{Element of boss battle in question}.pack</p></li><li>After you have ensured you've found the two seperate estus flask upgrades in that particular devine beast, delete the .pack file</li><li>Re-launch your game and do the boss battle now, it will no longer hang halfway through the fight</li></ol></div></div><button class=\"accordion-button\"><h2 class=\"accordion-title\">Second Wind Compatibility?</h2></button><div class=\"accordion-content\"><div class=\"content-centerer\"><p>As of right now Second wind SHOULD work with DtgA if placed lower in priority than DtgA mods. However, things change a lot in DtgA and sometimes new inconsistencies can be introduced. If you are experiencing issues it is recommended to turn this mod off for now and see if your issues go away.</p></div></div><button class=\"accordion-button\"><h2 class=\"accordion-title\">Can I play on the switch, or on real Wii U hardware?</h2></button><div class=\"accordion-content\"><div class=\"content-centerer\"><p>No, DtgA is not compatible with the switch or the original wii U hardware, you need BCML and Cemu to make DtgA work at all.</p></div></div></div></div>"
    },
    {
        "pageId": "itemsPage",
        "title":"Items | Dangerous to go Alone Wiki | Mod for BOTW",
        "pageContent": "<div id=\"items-page-container\" class=\"items-page-container\"><h1 class=\"section-title\">Key Items</h1><div id=\"keyitemsContainer\" class=\"card-container\"></div><h2 class=\"section-title\">Gadgets</h2><div id=\"gadgetsContainer\" class=\"card-container\"></div><h2 class=\"section-title\">Weapons</h2><div id=\"weaponsContainer\" class=\"card-container\"></div><h2 class=\"section-title\">Armors</h2><div id=\"armorsContainer\" class=\"card-container\"></div><h2 class=\"section-title\">Consumables</h2><div id=\"consumablesContainer\" class=\"card-container\"></div><h2 class=\"section-title\">Souls</h2><div id=\"soulsContainer\" class=\"card-container\"></div></div>"
    },
    {
        "pageId": "enemiesPage",
        "title":"Enemies | Dangerous to go Alone Wiki | Mod for BOTW",
        "pageContent": "<div id=\"enemies-page-container\" class=\"enemies-page-container\"><h1 class=\"section-title\">Common Enemies</h1><div id=\"commonEnemiesContainer\" class=\"card-container\"></div><h2 class=\"section-title\">Bosses</h2><div id=\"bossesContainer\" class=\"card-container\"></div></div>"
    },
    {
        "pageId": "npcsPage",
        "title":"NPCs | Dangerous to go Alone Wiki | Mod for BOTW",
        "pageContent": "<div id=\"npc-page-container\" class=\"npc-page-container\"><h1 class=\"section-title\">Companions</h1><div id=\"companionsContainer\" class=\"card-container\"></div><h2 class=\"section-title\">Vendors</h2><div id=\"vendorsContainer\" class=\"card-container\"></div><h2 class=\"section-title\">Lost Souls</h2><div id=\"lostSoulsContainer\" class=\"card-container\"></div></div>"
    },
    {
        "pageId": "locationsPage",
        "title":"Locations | Dangerous to go Alone Wiki | Mod for BOTW",
        "pageContent": "<div id=\"locations-page-container\" class=\"locations-page-container\"><h1 class=\"section-title\">Gadget Locations</h1><div class=\"highlight-bar\">Each of these locations, some old some new, hide one of DtgA's many Gadgets!</div><div id=\"locationsContainer\" class=\"card-container\"></div></div>"        
    }
]